import { IAcademyListData } from '../types';

export const digitAcademyMockData: IAcademyListData = {
	vipArticle: {
		weekDay: 'Понедельник',
		date: '12 мая',
		title: 'Никогда такого не было, и вот опять',
		desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
		img: 'http://172.16.3.123:81/download_file.html?file_id=7057155147796458950',
		articleId: '123123123123123' // Используется при клике для забора данных в модалку
	},
	regularArticles: [
		
		{
			weekDay: 'Понедельник',
			date: '12 мая',
			title: 'Никогда такого не было, и вот опять',
			desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
			img: 'http://172.16.3.123:81/download_file.html?file_id=7057178197481046047',
			articleId: '123123123123123' // Используется при клике для забора данных в модалку
		},
		{
			weekDay: 'Вторник',
			date: '12 мая',
			title: 'Никогда такого не было, и вот опять',
			desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
			img: 'http://172.16.3.123:81/download_file.html?file_id=7057178197481046047',
			articleId: '123123123123123' // Используется при клике для забора данных в модалку
		},
		{
			weekDay: 'Понедельник',
			date: '12 мая',
			title: 'Никогда такого не было, и вот опять',
			desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
			img: 'http://172.16.3.123:81/download_file.html?file_id=7057178197481046047',
			articleId: '123123123123123' // Используется при клике для забора данных в модалку
		},
		{
			weekDay: 'Вторник',
			date: '12 мая',
			title: 'Никогда такого не было, и вот опять',
			desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
			img: 'http://172.16.3.123:81/download_file.html?file_id=7057178197481046047',
			articleId: '123123123123123' // Используется при клике для забора данных в модалку
		},
		{
			weekDay: 'Понедельник',
			date: '12 мая',
			title: 'Никогда такого не было, и вот опять',
			desc: 'тут крутой текст о том какая там крутая статья, наверное да но это не точно',
			img: 'http://172.16.3.123:81/download_file.html?file_id=7057178197481046047',
			articleId: '123123123123123' // Используется при клике для забора данных в модалку
		}
	]
};
