import { IGlossSelectionData } from '../types';

export const glossWidgetMockData: IGlossSelectionData[] = [
	{
		liter: 'А',
		words: [
			{
				title: 'Agile',
				desc: 'Cобирательное название различных методик и подходов к управлению, применяемых в сфере разработки новых продуктов в проектных условиях высокой доли неопределённости. Эти методики направлены на фокусировку команды на нуждах и целях клиентов, упрощение оргработу короткими циклами, активно используют обратную связь, предполагают повышение полномочий сотрудников.'
			},
			{
				title: 'Agile-Коуч',
				desc: 'эксперт по гибкому подходу к разработке и развитию продуктов, который умеет внедрять Agile и соответствующие практики в работу компании. Это интегративная роль, которая включает в себя фасилитационную работу с командой, а также консультационную, обучающую и тренерскую работу.'
			},
			{
				title: 'Agile-манифест',
				desc: 'основной документ, содержащий описание 4 идей и 12 принципов Agile (описание находится на странице турбо-сообщества в базе знаний в разделе «agile-манифест»).'
			},
			{
				title: 'Артефакт (Artifacts)',
				desc: 'ключевая информация, которую Скрам-команда и заинтересованные стороны должны знать о понимании разрабатываемого продукта, о выполненных мероприятиях и планируемых мероприятиях в проекте.'
			}
		]
	},
	{
		liter: 'Б',
		words: [
			{
				title: 'Бэклог Продукта (Product backlog)',
				desc: 'упорядоченный список всего, что может понадобиться в продукте. Это единственный источник требований для любого вида изменений, которые могут быть внесены в продукт. Ответственность за Бэклог Продукта, включая его содержание, доступность и упорядочивание элементов, несет Владелец Продукта.'
			},
			{
				title: 'Бэклог Продукта (Product backlog)',
				desc: 'упорядоченный список всего, что может понадобиться в продукте. Это единственный источник требований для любого вида изменений, которые могут быть внесены в продукт. Ответственность за Бэклог Продукта, включая его содержание, доступность и упорядочивание элементов, несет Владелец Продукта.'
			},
			{
				title: 'Бэклог Продукта (Product backlog)',
				desc: 'упорядоченный список всего, что может понадобиться в продукте. Это единственный источник требований для любого вида изменений, которые могут быть внесены в продукт. Ответственность за Бэклог Продукта, включая его содержание, доступность и упорядочивание элементов, несет Владелец Продукта.'
			}
		]
	}
];
